lixpaulian/efr32xx-rail/platform/emlib/inc/em_emu.h
/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

#if defined(_EMU_CMD_EM01VSCALE0_MASK)
/** EM0 and 1 initialization structure. Voltage scaling is applied when
    the core clock frequency is changed from @ref CMU. EM0 an 1 emuVScaleEM01_HighPerformance
    is always enabled. */
typedef struct {
  bool  vScaleEM01LowPowerVoltageEnable;                 /**< EM0/1 low power voltage status */
} EMU_EM01Init_TypeDef;
#endif

#if defined(_EMU_CMD_EM01VSCALE0_MASK)
/** Default initialization of EM0 and 1 configuration */
#define EMU_EM01INIT_DEFAULT                                                               \
  {                                                                                        \
    false                                                /** Do not scale down in EM0/1 */ \
  }
#endif

/** EM2 and 3 initialization structure  */
typedef struct {
  bool                          em23VregFullEn;         /**< Enable full VREG drive strength in EM2/3 */
#if defined(_EMU_CTRL_EM23VSCALE_MASK)
  EMU_VScaleEM23_TypeDef        vScaleEM23Voltage;      /**< EM2/3 voltage scaling level */
#endif
} EMU_EM23Init_TypeDef;

/** Default initialization of EM2 and 3 configuration */
#if defined(_EMU_CTRL_EM4HVSCALE_MASK)
#define EMU_EM23INIT_DEFAULT                                                                                    \
  {                                                                                                             \
    false,                                              /* Reduced voltage regulator drive strength in EM2/3 */ \
    emuVScaleEM23_FastWakeup,                           /* Do not scale down in EM2/3 */                        \
  }
#else
#define EMU_EM23INIT_DEFAULT                                                                                    \
  {                                                                                                             \
    false,                                              /* Reduced voltage regulator drive strength in EM2/3 */ \
  }
#endif

#if defined(_EMU_EM4CONF_MASK) || defined(_EMU_EM4CTRL_MASK)
/** EM4 initialization structure  */
typedef struct {
#if defined(_EMU_EM4CONF_MASK)
  /* Init parameters for platforms with EMU->EM4CONF register (Series 0) */
  bool                        lockConfig;       /**< Lock configuration of regulator, BOD and oscillator */
  bool                        buBodRstDis;      /**< When set, no reset will be asserted due to Brownout when in EM4 */
  EMU_EM4Osc_TypeDef          osc;              /**< EM4 duty oscillator */
  bool                        buRtcWakeup;      /**< Wake up on EM4 BURTC interrupt */
  bool                        vreg;             /**< Enable EM4 voltage regulator */
#elif defined(_EMU_EM4CTRL_MASK)
  /* Init parameters for platforms with EMU->EM4CTRL register (Series 1) */
  bool                        retainLfxo;       /**< Disable the LFXO upon EM4 entry */
  bool                        retainLfrco;      /**< Disable the LFRCO upon EM4 entry */
  bool                        retainUlfrco;     /**< Disable the ULFRCO upon EM4 entry */
  EMU_EM4State_TypeDef        em4State;         /**< Hibernate or shutoff EM4 state */
  EMU_EM4PinRetention_TypeDef pinRetentionMode; /**< EM4 pin retention mode */
#endif
#if defined(_EMU_CTRL_EM4HVSCALE_MASK)
  EMU_VScaleEM4H_TypeDef      vScaleEM4HVoltage;/**< EM4H voltage scaling level */
#endif
} EMU_EM4Init_TypeDef;
#endif

#if defined(_EMU_EM4CONF_MASK)
/** Default initialization of EM4 configuration (Series 0) */
#define EMU_EM4INIT_DEFAULT                                                               \
  {                                                                                       \
    false,                            /* Dont't lock configuration after it's been set */ \
    false,                            /* No reset will be asserted due to BOD in EM4 */   \
    emuEM4Osc_ULFRCO,                 /* Use default ULFRCO oscillator  */                \
    true,                             /* Wake up on EM4 BURTC interrupt */                \
    true,                             /* Enable VREG */                                   \
  }

#elif defined(_EMU_CTRL_EM4HVSCALE_MASK)
/** Default initialization of EM4 configuration (Series 1 with VSCALE) */
#define EMU_EM4INIT_DEFAULT                                                           \
  {                                                                                   \
    false,                           /* Retain LFXO configuration upon EM4 entry */   \
    false,                           /* Retain LFRCO configuration upon EM4 entry */  \
    false,                           /* Retain ULFRCO configuration upon EM4 entry */ \
    emuEM4Shutoff,                   /* Use EM4 shutoff state */                      \
    emuPinRetentionDisable,          /* Do not retain pins in EM4 */                  \
    emuVScaleEM4H_FastWakeup,        /* Do not scale down in EM4H */                  \
  }

#elif defined(_EMU_EM4CTRL_MASK)
/** Default initialization of EM4 configuration (Series 1 without VSCALE) */
#define EMU_EM4INIT_DEFAULT                                                           \
  {                                                                                   \
    false,                           /* Retain LFXO configuration upon EM4 entry */   \
    false,                           /* Retain LFRCO configuration upon EM4 entry */  \
    false,                           /* Retain ULFRCO configuration upon EM4 entry */ \
    emuEM4Shutoff,                   /* Use EM4 shutoff state */                      \
    emuPinRetentionDisable,          /* Do not retain pins in EM4 */                  \
  }
#endif

#if defined(BU_PRESENT)
/** Backup Power Domain Initialization structure */
typedef struct {
  /* Backup Power Domain power configuration */

  /** Voltage probe select, selects ADC voltage */
  EMU_Probe_TypeDef     probe;
  /** Enable BOD calibration mode */
  bool                  bodCal;
  /** Enable BU_STAT status pin for active BU mode */
  bool                  statusPinEnable;

  /* Backup Power Domain connection configuration */
  /** Power domain resistor */
  EMU_Resistor_TypeDef  resistor;
  /** BU_VOUT strong enable */
  bool                  voutStrong;
  /** BU_VOUT medium enable */
  bool                  voutMed;
  /** BU_VOUT weak enable */
  bool                  voutWeak;
  /** Power connection, when not in Backup Mode */
  EMU_Power_TypeDef  inactivePower;
  /** Power connection, when in Backup Mode */
  EMU_Power_TypeDef     activePower;
  /** Enable backup power domain, and release reset, enable BU_VIN pin  */
  bool                  enable;
} EMU_BUPDInit_TypeDef;

/** Default Backup Power Domain configuration */
#define EMU_BUPDINIT_DEFAULT                                                             \
  {                                                                                      \
    emuProbe_Disable, /* Do not enable voltage probe */                                  \
    false,          /* Disable BOD calibration mode */                                   \
    false,          /* Disable BU_STAT pin for backup mode indication */                 \
                                                                                         \
    emuRes_Res0,    /* RES0 series resistance between main and backup power */           \
    false,          /* Don't enable strong switch */                                     \
    false,          /* Don't enable medium switch */                                     \
    false,          /* Don't enable weak switch */                                       \
                                                                                         \
    emuPower_None,  /* No connection between main and backup power (inactive mode) */    \
    emuPower_None,  /* No connection between main and backup power (active mode) */      \
    true            /* Enable BUPD enter on BOD, enable BU_VIN pin, release BU reset  */ \
  }
#endif

