lixpaulian/efr32xx-rail/platform/emlib/inc/em_emu.h
#if defined(_EMU_DCDCCTRL_MASK)
/** DCDC initialization structure */
typedef struct {
  EMU_PowerConfig_TypeDef powerConfig;                  /**< Device external power configuration.
                                                             @ref emuPowerConfig_DcdcToDvdd is currently the only supported mode. */
  EMU_DcdcMode_TypeDef dcdcMode;                        /**< DCDC regulator operating mode in EM0/1 */
  uint16_t mVout;                                       /**< Target output voltage (mV) */
  uint16_t em01LoadCurrent_mA;                          /**< Estimated average load current in EM0/1 (mA).
                                                             This estimate is also used for EM1 optimization,
                                                             so if EM1 current is expected to be higher than EM0,
                                                             then this parameter should hold the higher EM1 current. */
  uint16_t em234LoadCurrent_uA;                         /**< Estimated average load current in EM2 (uA).
                                                             This estimate is also used for EM3 and 4 optimization,
                                                             so if EM3 or 4 current is expected to be higher than EM2,
                                                             then this parameter should hold the higher EM3 or 4 current. */
  uint16_t maxCurrent_mA;                               /**< Maximum average DCDC output current (mA).
                                                             This can be set to the maximum for the power source,
                                                             for example the maximum for a battery. */
  EMU_DcdcAnaPeripheralPower_TypeDef
    anaPeripheralPower;                                 /**< Select analog peripheral power in DCDC-to-DVDD mode */
  EMU_DcdcLnReverseCurrentControl_TypeDef
    reverseCurrentControl;                              /**< Low-noise reverse current control.
                                                             NOTE: this parameter uses special encoding:
                                                             >= 0 is forced CCM mode where the parameter is used as the
                                                                  reverse current threshold in mA.
                                                             -1   is encoded as emuDcdcLnHighEfficiencyMode (EFM32 only) */
  EMU_DcdcLnCompCtrl_TypeDef dcdcLnCompCtrl;            /**< DCDC Low-noise mode compensator control. */
} EMU_DCDCInit_TypeDef;

/** Default DCDC initialization */
#if defined(_EFM_DEVICE)
#if defined(_SILICON_LABS_GECKO_INTERNAL_SDID_80)
#define EMU_DCDCINIT_DEFAULT                                                        \
  {                                                                                 \
    emuPowerConfig_DcdcToDvdd,   /* DCDC to DVDD */                                 \
    emuDcdcMode_LowNoise,        /* Low-niose mode in EM0 */                        \
    1800,                        /* Nominal output voltage for DVDD mode, 1.8V  */  \
    5,                           /* Nominal EM0/1 load current of less than 5mA */  \
    10,                          /* Nominal EM2/3/4 load current less than 10uA  */ \
    200,                         /* Maximum average current of 200mA
                                    (assume strong battery or other power source) */      \
    emuDcdcAnaPeripheralPower_DCDC,/* Select DCDC as analog power supply (lower power) */ \
    emuDcdcLnHighEfficiency,     /* Use high-efficiency mode */                           \
    emuDcdcLnCompCtrl_1u0F,      /* 1uF DCDC capacitor */                                 \
  }
#else
#define EMU_DCDCINIT_DEFAULT                                                        \
  {                                                                                 \
    emuPowerConfig_DcdcToDvdd,   /* DCDC to DVDD */                                 \
    emuDcdcMode_LowPower,        /* Low-power mode in EM0 */                        \
    1800,                        /* Nominal output voltage for DVDD mode, 1.8V  */  \
    5,                           /* Nominal EM0/1 load current of less than 5mA */  \
    10,                          /* Nominal EM2/3/4 load current less than 10uA  */ \
    200,                         /* Maximum average current of 200mA
                                    (assume strong battery or other power source) */      \
    emuDcdcAnaPeripheralPower_DCDC,/* Select DCDC as analog power supply (lower power) */ \
    emuDcdcLnHighEfficiency,     /* Use high-efficiency mode */                           \
    emuDcdcLnCompCtrl_4u7F,      /* 4.7uF DCDC capacitor */                               \
  }
#endif

#else /* EFR32 device */
#if defined(_SILICON_LABS_GECKO_INTERNAL_SDID_80)
#define EMU_DCDCINIT_DEFAULT                                                        \
  {                                                                                 \
    emuPowerConfig_DcdcToDvdd,   /* DCDC to DVDD */                                 \
    emuDcdcMode_LowNoise,        /* Low-niose mode in EM0 */                        \
    1800,                        /* Nominal output voltage for DVDD mode, 1.8V  */  \
    15,                          /* Nominal EM0/1 load current of less than 15mA */ \
    10,                          /* Nominal EM2/3/4 load current less than 10uA  */ \
    200,                         /* Maximum average current of 200mA
                                    (assume strong battery or other power source) */      \
    emuDcdcAnaPeripheralPower_DCDC,/* Select DCDC as analog power supply (lower power) */ \
    160,                         /* Maximum reverse current of 160mA */                   \
    emuDcdcLnCompCtrl_1u0F,      /* 1uF DCDC capacitor */                                 \
  }
#else
#define EMU_DCDCINIT_DEFAULT                                                        \
  {                                                                                 \
    emuPowerConfig_DcdcToDvdd,   /* DCDC to DVDD */                                 \
    emuDcdcMode_LowNoise,        /* Low-niose mode in EM0 */                        \
    1800,                        /* Nominal output voltage for DVDD mode, 1.8V  */  \
    15,                          /* Nominal EM0/1 load current of less than 15mA */ \
    10,                          /* Nominal EM2/3/4 load current less than 10uA  */ \
    200,                         /* Maximum average current of 200mA
                                    (assume strong battery or other power source) */      \
    emuDcdcAnaPeripheralPower_DCDC,/* Select DCDC as analog power supply (lower power) */ \
    160,                         /* Maximum reverse current of 160mA */                   \
    emuDcdcLnCompCtrl_4u7F,      /* 4.7uF DCDC capacitor */                               \
  }
#endif
#endif
#endif

#if defined(EMU_STATUS_VMONRDY)
/** VMON initialization structure */
typedef struct {
  EMU_VmonChannel_TypeDef channel;      /**< VMON channel to configure */
  int threshold;                        /**< Trigger threshold (mV). Supported range is 1620 mV to 3400 mV */
  bool riseWakeup;                      /**< Wake up from EM4H on rising edge */
  bool fallWakeup;                      /**< Wake up from EM4H on falling edge */
  bool enable;                          /**< Enable VMON channel */
  bool retDisable;                      /**< Disable IO0 retention when voltage drops below threshold (IOVDD only) */
} EMU_VmonInit_TypeDef;

/** Default VMON initialization structure */
#define EMU_VMONINIT_DEFAULT                                                       \
  {                                                                                \
    emuVmonChannel_AVDD,                /* AVDD VMON channel */                    \
    3200,                               /* 3.2 V threshold */                      \
    false,                              /* Don't wake from EM4H on rising edge */  \
    false,                              /* Don't wake from EM4H on falling edge */ \
    true,                               /* Enable VMON channel */                  \
    false                               /* Don't disable IO0 retention */          \
  }

